org/20220517091438-excessive_reliance_on_market_is_a_form_of_nihilism.org
:PROPERTIES:
:ID:       3a4f0f95-2678-48b9-bce2-851982f8be30
:END:
#+TITLE: Excessive reliance on market is a form of nihilism
#+CREATED: [2022-05-17 Tue 09:14]
#+LAST_MODIFIED: [2022-05-27 Fri 10:49]

It stems from the realization that men are not able to build and maintain organizations that recruit and educate the best leaders that are able to make the best decisions for the community. This is problematic however because [[id:8075ac29-97a9-495a-86c6-c04a0c2aa4d0][Democracy is what reduces entropy]] and there is no way around centralized planning (decision-making) to give rough directions for the economy. This will be necessary to prevent and mitigate the effects of climate change.

If we throw our hands in the air and hope for the market to solve everything we will end up with finance being the entire economy.

* References

- Cohen & Bradford DeLong. Concrete Economics: The Hamilton Approach to Economic Growth and Policy.
