20220517091438-excessive_reliance_on_market_is_a_form_of_nihilism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-27 Fri 11:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Excessive reliance on market is a form of nihilism</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Excessive reliance on market is a form of nihilism</h1>
<p>
It stems from the realization that men are not able to build and maintain organizations that recruit and educate the best leaders that are able to make the best decisions for the community. This is problematic however because <a href="20220111193751-democracy_is_what_reduces_entropy.html#ID-8075ac29-97a9-495a-86c6-c04a0c2aa4d0">Democracy is what reduces entropy</a> and there is no way around centralized planning (decision-making) to give rough directions for the economy. This will be necessary to prevent and mitigate the effects of climate change.
</p>

<p>
If we throw our hands in the air and hope for the market to solve everything we will end up with finance being the entire economy.
</p>

<div id="outline-container-org87095f3" class="outline-2">
<h2 id="org87095f3">References</h2>
<div class="outline-text-2" id="text-org87095f3">
<ul class="org-ul">
<li>Cohen &amp; Bradford DeLong. Concrete Economics: The Hamilton Approach to Economic Growth and Policy.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9e0c7c" class="outline-2">
<h2 id="orgd9e0c7c">Links to this note</h2>
</div>
</div>
</body>
</html>